; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v8 ?v4)
             (pred_3 ?v10 ?v11)
             (pred_2 ?v8 ?v11)
             (pred_10 ?v12 ?v8 )
	     (pred_7 ?v8)
             (pred_11 ?v7)
             (pred_9 ?v10)
             (pred_5 ?v11)
             (pred_1 ?v8)
             (pred_12 ?v10)
             (pred_4 ?v8)
             (pred_8 ))



(:action op_3
:parameters (?v13 ?v1 ?v6 ?v3)
:precondition (and (pred_11 ?v13) (pred_11 ?v1) (pred_9 ?v6) (pred_5 ?v3)
          (pred_6 ?v13 ?v1) (pred_3 ?v6 ?v3)
                   (pred_2 ?v1 ?v3) (pred_7 ?v13) 
                   (pred_1 ?v1) (pred_12 ?v6))
:effect (and  (pred_4 ?v1) (not (pred_1 ?v1))))


(:action op_5
:parameters (?v13 ?v5)
:precondition (and (pred_11 ?v13) (pred_11 ?v5)
               (pred_7 ?v13) (pred_6 ?v13 ?v5) (pred_4 ?v5))
:effect (and (pred_7 ?v5) (not (pred_7 ?v13))))

(:action op_2
:parameters (?v13 ?v6)
:precondition (and (pred_11 ?v13) (pred_9 ?v6) 
                  (pred_7 ?v13) (pred_10 ?v6 ?v13) (pred_8 ))
:effect (and (pred_12 ?v6)
   (not (pred_10 ?v6 ?v13)) (not (pred_8 ))))


(:action op_1
:parameters (?v13 ?v9 ?v2)
:precondition (and (pred_11 ?v13) (pred_9 ?v9) (pred_9 ?v2)
                  (pred_7 ?v13) (pred_12 ?v2) (pred_10 ?v9 ?v13))
:effect (and (pred_12 ?v9) (pred_10 ?v2 ?v13)
        (not (pred_12 ?v2)) (not (pred_10 ?v9 ?v13))))

(:action op_4
:parameters (?v13 ?v6)
:precondition (and (pred_11 ?v13) (pred_9 ?v6) 
                  (pred_7 ?v13) (pred_12 ?v6))
:effect (and (pred_8 ) (pred_10 ?v6 ?v13) (not (pred_12 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_02 obj_31 obj_10 obj_14 obj_21 obj_08 obj_25 obj_06 obj_17 obj_22 obj_09 obj_20 obj_16 obj_01 obj_28 obj_23 obj_30 obj_12 obj_05 obj_19 obj_26 obj_29 obj_07 obj_03
    obj_11 obj_13 obj_04
    obj_18 obj_27 obj_24
    )

    (:init
       (pred_8)

       (pred_11 obj_15)
       (pred_11 obj_02)
       (pred_11 obj_31)
       (pred_11 obj_10)
       (pred_11 obj_14)
       (pred_11 obj_21)
       (pred_11 obj_08)
       (pred_11 obj_25)
       (pred_11 obj_06)
       (pred_11 obj_17)
       (pred_11 obj_22)
       (pred_11 obj_09)
       (pred_11 obj_20)
       (pred_11 obj_16)
       (pred_11 obj_01)
       (pred_11 obj_28)
       (pred_11 obj_23)
       (pred_11 obj_30)
       (pred_11 obj_12)
       (pred_11 obj_05)
       (pred_11 obj_19)
       (pred_11 obj_26)
       (pred_11 obj_29)
       (pred_11 obj_07)
       (pred_11 obj_03)
       (pred_5 obj_11)
       (pred_5 obj_13)
       (pred_5 obj_04)
       (pred_9 obj_18)
       (pred_9 obj_27)
       (pred_9 obj_24)

       (pred_6 obj_15 obj_21)
       (pred_6 obj_15 obj_02)
       (pred_6 obj_02 obj_08)
       (pred_6 obj_02 obj_31)
       (pred_6 obj_02 obj_15)
       (pred_6 obj_31 obj_25)
       (pred_6 obj_31 obj_10)
       (pred_6 obj_31 obj_02)
       (pred_6 obj_10 obj_06)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_10 obj_31)
       (pred_6 obj_14 obj_17)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_21 obj_22)
       (pred_6 obj_21 obj_08)
       (pred_6 obj_21 obj_15)
       (pred_6 obj_08 obj_09)
       (pred_6 obj_08 obj_25)
       (pred_6 obj_08 obj_02)
       (pred_6 obj_08 obj_21)
       (pred_6 obj_25 obj_20)
       (pred_6 obj_25 obj_06)
       (pred_6 obj_25 obj_31)
       (pred_6 obj_25 obj_08)
       (pred_6 obj_06 obj_16)
       (pred_6 obj_06 obj_17)
       (pred_6 obj_06 obj_10)
       (pred_6 obj_06 obj_25)
       (pred_6 obj_17 obj_01)
       (pred_6 obj_17 obj_14)
       (pred_6 obj_17 obj_06)
       (pred_6 obj_22 obj_28)
       (pred_6 obj_22 obj_09)
       (pred_6 obj_22 obj_21)
       (pred_6 obj_09 obj_23)
       (pred_6 obj_09 obj_20)
       (pred_6 obj_09 obj_08)
       (pred_6 obj_09 obj_22)
       (pred_6 obj_20 obj_30)
       (pred_6 obj_20 obj_16)
       (pred_6 obj_20 obj_25)
       (pred_6 obj_20 obj_09)
       (pred_6 obj_16 obj_12)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_16 obj_20)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_01 obj_17)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_28 obj_19)
       (pred_6 obj_28 obj_23)
       (pred_6 obj_28 obj_22)
       (pred_6 obj_23 obj_26)
       (pred_6 obj_23 obj_30)
       (pred_6 obj_23 obj_09)
       (pred_6 obj_23 obj_28)
       (pred_6 obj_30 obj_29)
       (pred_6 obj_30 obj_12)
       (pred_6 obj_30 obj_20)
       (pred_6 obj_30 obj_23)
       (pred_6 obj_12 obj_07)
       (pred_6 obj_12 obj_05)
       (pred_6 obj_12 obj_16)
       (pred_6 obj_12 obj_30)
       (pred_6 obj_05 obj_03)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_05 obj_12)
       (pred_6 obj_19 obj_26)
       (pred_6 obj_19 obj_28)
       (pred_6 obj_26 obj_29)
       (pred_6 obj_26 obj_23)
       (pred_6 obj_26 obj_19)
       (pred_6 obj_29 obj_07)
       (pred_6 obj_29 obj_30)
       (pred_6 obj_29 obj_26)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_07 obj_12)
       (pred_6 obj_07 obj_29)
       (pred_6 obj_03 obj_05)
       (pred_6 obj_03 obj_07)
       (pred_1 obj_01)
       (pred_1 obj_08)
       (pred_1 obj_14)
       (pred_2  obj_01 obj_11)
       (pred_2  obj_08 obj_13)
       (pred_2  obj_14 obj_04)
       (pred_4 obj_15)
       (pred_4 obj_02)
       (pred_4 obj_31)
       (pred_4 obj_10)
       (pred_4 obj_21)
       (pred_4 obj_25)
       (pred_4 obj_06)
       (pred_4 obj_17)
       (pred_4 obj_22)
       (pred_4 obj_09)
       (pred_4 obj_20)
       (pred_4 obj_16)
       (pred_4 obj_28)
       (pred_4 obj_23)
       (pred_4 obj_30)
       (pred_4 obj_12)
       (pred_4 obj_05)
       (pred_4 obj_19)
       (pred_4 obj_26)
       (pred_4 obj_29)
       (pred_4 obj_07)
       (pred_4 obj_03)

       (pred_3  obj_18 obj_11)
       (pred_3  obj_27 obj_13)
       (pred_3  obj_24 obj_04)
       (pred_10 obj_18 obj_19)
       (pred_10 obj_27 obj_17)
       (pred_10 obj_24 obj_02)
       (pred_7 obj_21)
    )

    (:goal (and
       (pred_10 obj_27 obj_29)
    ))
(:constraints
  (always (not (pred_7 obj_20)))
)
)

; plan
1. (op_5 obj_21 obj_15)
   deleted: (pred_7 obj_21)
   added: (pred_7 obj_15)
   goals met: 0 of 1
2. (op_5 obj_15 obj_02)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_02)
   goals met: 0 of 1
3. (op_5 obj_02 obj_31)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_31)
   goals met: 0 of 1
4. (op_5 obj_31 obj_25)
   deleted: (pred_7 obj_31)
   added: (pred_7 obj_25)
   goals met: 0 of 1
5. (op_5 obj_25 obj_06)
   deleted: (pred_7 obj_25)
   added: (pred_7 obj_06)
   goals met: 0 of 1
6. (op_5 obj_06 obj_17)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_17)
   goals met: 0 of 1
7. (op_2 obj_17 obj_27)
   deleted: (pred_10 obj_27 obj_17) (pred_8)
   added: (pred_12 obj_27)
   goals met: 0 of 1
8. (op_5 obj_17 obj_06)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_06)
   goals met: 0 of 1
9. (op_5 obj_06 obj_16)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_16)
   goals met: 0 of 1
10. (op_5 obj_16 obj_12)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_12)
   goals met: 0 of 1
11. (op_5 obj_12 obj_30)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_30)
   goals met: 0 of 1
12. (op_5 obj_30 obj_29)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_29)
   goals met: 0 of 1
13. (op_4 obj_29 obj_27)
   deleted: (pred_12 obj_27)
   added: (pred_8) (pred_10 obj_27 obj_29)
   goals met: 1 of 1
